davelee98/Firmware_Unified/targets/efr32bg22-slc/opendisplay_display.cpp
#include "opendisplay_display.h"
#include "opendisplay_display_color.h"
#include "opendisplay_ble.h"
#include "opendisplay_config_parser.h"
#include "opendisplay_constants.h"
#include "opendisplay_epd_map.h"
#include "opendisplay_runtime.h"
#include "bb_epaper.h"
#include "od_bbep_efr32.h"
#include "od_boot_payload.h"
#include "od_caps.h"
#include "em_cmu.h"
#include "em_gpio.h"
#include "em_system.h"
#include "qrcode/qrcode.h"
#include "sl_sleeptimer.h"
#include <stdio.h>
#include <string.h>

extern "C" {
#include "od_zlib_inflate.h"
}

#define OPENDISPLAY_DECOMPRESSION_CHUNK_SIZE 256u

/* Raw BBEPDISP, not the vendored BBEPAPER C++ class -- see panel/od_bbep_efr32.h. The class is
 * not compiled on this target, matching esp32-idf and nordic-zephyr. */
static BBEPDISP s_epd;
static bool s_active;
static uint32_t s_total_bytes;
static uint32_t s_written_bytes;
static uint32_t s_dw_chunk_n;
static uint8_t s_dw_log_pct;
static uint8_t s_dw_trailing_ignores;
static uint32_t s_dw_init_t0;
static uint8_t s_color_scheme;
static uint32_t s_plane_size;
static bool s_plane2_started;
static bool s_boot_applied;
static bool s_dw_compressed;
static uint32_t s_dw_decompressed_total;
static uint8_t s_decompression_chunk[OPENDISPLAY_DECOMPRESSION_CHUNK_SIZE];

#ifndef OD_FALLBACK_DISPLAY_PWR_PIN
#define OD_FALLBACK_DISPLAY_PWR_PIN 0x00u
#endif

static void dw_init_mark(const char *tag)
{
  uint32_t now = sl_sleeptimer_get_tick_count();
  printf("[OD] dw init %-26s %lu ms\r\n", tag, (unsigned long)sl_sleeptimer_tick_to_ms(now - s_dw_init_t0));
}

static const struct DisplayConfig *display_cfg(void)
{
  const struct GlobalConfig *cfg = opendisplay_get_global_config();
  if (cfg == nullptr || cfg->display_count == 0u) {
    return nullptr;
  }
  return &cfg->displays[0];
}

static bool decode_pin(uint8_t v, GPIO_Port_TypeDef *port_out, uint8_t *pin_out)
{
  unsigned pr;
  unsigned pn;
  if (v == GPIO_PIN_UNUSED) {
    return false;
  }
  pr = (unsigned)(v >> 4) & 0x0Fu;
  pn = (unsigned)(v & 0x0Fu);
  if (pr > (unsigned)GPIO_PORT_MAX || pn > 15u) {
    return false;
  }
  *port_out = (GPIO_Port_TypeDef)(gpioPortA + pr);
  *pin_out = (uint8_t)pn;
  return true;
}

static void display_park_signal_pin(uint8_t pin_cfg)
{
  GPIO_Port_TypeDef port;
  uint8_t pin;

  if (!decode_pin(pin_cfg, &port, &pin)) {
    return;
  }
  GPIO_PinModeSet(port, pin, gpioModeDisabled, 0);
}

void opendisplay_display_park_pins(void)
{
  const struct DisplayConfig *d = display_cfg();

  if (d == nullptr) {
    return;
  }
  CMU_ClockEnable(cmuClock_GPIO, true);
  display_park_signal_pin(d->cs_pin);
  display_park_signal_pin(d->data_pin);
  display_park_signal_pin(d->clk_pin);
  display_park_signal_pin(d->dc_pin);
  display_park_signal_pin(d->reset_pin);
  display_park_signal_pin(d->busy_pin);
}

static void display_power_set(bool on)
{
  const struct GlobalConfig *cfg = opendisplay_get_global_config();
  uint8_t p;
  GPIO_Port_TypeDef port;
  uint8_t pin;
  if (cfg == nullptr) {
    return;
  }
  CMU_ClockEnable(cmuClock_GPIO, true);
  if (!on) {
    opendisplay_display_park_pins();
  }
  p = cfg->system_config.pwr_pin;
  if (p == GPIO_PIN_UNUSED) {
    p = OD_FALLBACK_DISPLAY_PWR_PIN;
  }
  if (!decode_pin(p, &port, &pin)) {
    return;
  }
  GPIO_PinModeSet(port, pin, gpioModePushPull, on ? 1u : 0u);
}

void opendisplay_display_power_off(void)
{
  display_power_set(false);
}

typedef struct {
  char c;
  uint8_t col[5];
} Glyph5x7;

static const Glyph5x7 s_font5x7[] = {
  { ' ', { 0, 0, 0, 0, 0 } },       { '.', { 0, 0, 0x40, 0, 0 } }, { ':', { 0, 0x24, 0, 0, 0 } },
  { '0', { 0x3E, 0x51, 0x49, 0x45, 0x3E } },
  { '1', { 0x00, 0x42, 0x7F, 0x40, 0x00 } }, { '2', { 0x62, 0x51, 0x49, 0x49, 0x46 } },
  { '3', { 0x22, 0x49, 0x49, 0x49, 0x36 } }, { '4', { 0x18, 0x14, 0x12, 0x7F, 0x10 } },
  { '5', { 0x2F, 0x49, 0x49, 0x49, 0x31 } }, { '6', { 0x3E, 0x49, 0x49, 0x49, 0x32 } },
  { '7', { 0x01, 0x71, 0x09, 0x05, 0x03 } }, { '8', { 0x36, 0x49, 0x49, 0x49, 0x36 } },
  { '9', { 0x26, 0x49, 0x49, 0x49, 0x3E } }, { 'A', { 0x7E, 0x11, 0x11, 0x11, 0x7E } },
  { 'B', { 0x7F, 0x49, 0x49, 0x49, 0x36 } }, { 'C', { 0x3E, 0x41, 0x41, 0x41, 0x22 } },
  { 'D', { 0x7F, 0x41, 0x41, 0x22, 0x1C } }, { 'E', { 0x7F, 0x49, 0x49, 0x49, 0x41 } },
  { 'F', { 0x7F, 0x09, 0x09, 0x09, 0x01 } }, { 'G', { 0x3E, 0x41, 0x49, 0x49, 0x7A } },
  { 'I', { 0x00, 0x41, 0x7F, 0x41, 0x00 } }, { 'L', { 0x7F, 0x40, 0x40, 0x40, 0x40 } },
  { 'N', { 0x7F, 0x02, 0x0C, 0x10, 0x7F } }, { 'O', { 0x3E, 0x41, 0x41, 0x41, 0x3E } },
  { 'P', { 0x7F, 0x09, 0x09, 0x09, 0x06 } }, { 'R', { 0x7F, 0x09, 0x19, 0x29, 0x46 } },
  { 'S', { 0x26, 0x49, 0x49, 0x49, 0x32 } }, { 'W', { 0x3F, 0x40, 0x38, 0x40, 0x3F } },
  { 'Y', { 0x07, 0x08, 0x70, 0x08, 0x07 } },
};

static const uint8_t *glyph5x7(char c)
{
  unsigned i;
  for (i = 0; i < (sizeof(s_font5x7) / sizeof(s_font5x7[0])); i++) {
    if (s_font5x7[i].c == c) {
      return s_font5x7[i].col;
    }
  }
  return s_font5x7[0].col;
}

static void set_pixel_row(uint8_t *row, int x, int bits_per_pixel)
{
  if (bits_per_pixel == 4) {
    row[x >> 1] &= (uint8_t)~(0xF0u >> ((unsigned)(x & 1) * 4u));
  } else if (bits_per_pixel == 2) {
    row[x >> 2] &= (uint8_t)~(0xC0u >> ((unsigned)(x & 3) * 2u));
  } else {
    row[x >> 3] &= (uint8_t)~(0x80u >> ((unsigned)x & 7u));
  }
}

static void make_gray4_plane_row(uint8_t *plane_row, const uint8_t *row_2bpp,
                                 int plane_pitch, uint16_t width, int bit_select)
{
  memset(plane_row, 0x00, (size_t)plane_pitch);
  for (uint16_t x = 0; x < width; x++) {
    uint8_t code = (uint8_t)((~(row_2bpp[x >> 2] >> (6 - ((x & 3u) << 1)))) & 0x03u);
    if (((code >> bit_select) & 0x01u) != 0u) {
      plane_row[x >> 3] |= (uint8_t)(0x80u >> (x & 7u));
    }
  }
}

static void draw_text_row(uint8_t *row, int y, int x0, int y0, const char *s, int scale, int bits_per_pixel,
                          int max_x)
{
  int cursor = x0;
  const char *p;
  if (s == nullptr || scale <= 0) {
    return;
  }
  for (p = s; *p != '\0'; p++) {
    const uint8_t *g = glyph5x7(*p);
    int col, gy, sx;
    for (col = 0; col < 5; col++) {
      for (gy = 0; gy < 7; gy++) {
        int py, px;
        if (((g[col] >> gy) & 1u) == 0u) {
          continue;
        }
        py = y0 + gy * scale;
        if (y < py || y >= py + scale) {
          continue;
        }
        px = cursor + col * scale;
        for (sx = 0; sx < scale; sx++) {
          int rx = px + sx;
          if (rx >= 0 && (max_x < 0 || rx < max_x)) {
            set_pixel_row(row, rx, bits_per_pixel);
          }
        }
      }
    }
    cursor += 6 * scale;
  }
}

static uint16_t text_width_px(const char *s, int scale)
{
  if (s == nullptr || scale <= 0) {
    return 0u;
  }
  return (uint16_t)(strlen(s) * (size_t)(6 * scale));
}

static int boot_line_step(int scale)
{
  return scale * 10;
}

static int boot_block_h(int scale)
{
  return 4 * boot_line_step(scale) + 7 * scale;
}

