davelee98/Firmware_Unified/targets/efr32bg22-slc/opendisplay_display.cpp
static uint16_t boot_max_text_width(const char *const *lines, unsigned n, int scale)
{
  uint16_t max_w = 0u;
  unsigned i;
  for (i = 0u; i < n; i++) {
    uint16_t tw = text_width_px(lines[i], scale);
    if (tw > max_w) {
      max_w = tw;
    }
  }
  return max_w;
}

static bool boot_layout_fit(uint16_t w, uint16_t h, int scale, int pad, int qr_modules, int *module_px_out,
                            int *qr_px_out, bool *qr_right_out, int *qr_x_out, int *qr_y_out, int *avail_w_out,
                            int *text_y_out, uint16_t max_text_w)
{
  int block_h = boot_block_h(scale);
  int text_gap = pad;
  int side_gap = pad;
  int module_px;
  int qr_px;
  int min_dim = (int)((w < h) ? w : h);
  int module_ideal = (min_dim - pad * 2) / (int)qr_modules;
  if (module_ideal < 1) {
    module_ideal = 1;
  }
  if (module_ideal > 6) {
    module_ideal = 6;
  }

  for (module_px = module_ideal; module_px >= 1; module_px--) {
    qr_px = module_px * (int)qr_modules;
    if (qr_px > (int)w - pad * 2) {
      continue;
    }
    if ((int)w >= pad * 2 + (int)max_text_w + side_gap + qr_px
        && (int)h >= pad * 2 + (block_h > qr_px ? block_h : qr_px)) {
      int avail_w = (int)w - pad * 2 - qr_px - side_gap;
      if ((int)max_text_w <= avail_w) {
        int qr_x = (int)w - pad - qr_px;
        int qr_y = pad;
        int text_y = pad;
        if (block_h < qr_px) {
          text_y = pad + (qr_px - block_h) / 2;
        }
        *module_px_out = module_px;
        *qr_px_out = qr_px;
        *qr_right_out = true;
        *qr_x_out = qr_x;
        *qr_y_out = qr_y;
        *avail_w_out = avail_w;
        *text_y_out = text_y;
        return true;
      }
    }
    if ((int)w >= pad * 2 + (int)max_text_w && (int)h >= pad * 2 + block_h + text_gap + qr_px) {
      *module_px_out = module_px;
      *qr_px_out = qr_px;
      *qr_right_out = false;
      *qr_x_out = ((int)w - qr_px) / 2;
      *qr_y_out = (int)h - pad - qr_px;
      *avail_w_out = (int)w - pad * 2;
      *text_y_out = pad;
      return true;
    }
  }
  return false;
}


static bool render_boot_screen(BBEPDISP &epd, const struct GlobalConfig *cfg)
{
  static const uint8_t zero_key[OD_BOOT_KEY_SIZE] = { 0 };
  const struct SecurityConfig *sec = od_get_parsed_security();
  const struct DisplayConfig *dc;
  uint16_t w, h;
  uint32_t last3;
  const uint8_t *key;
  bool show_key;
  char url[OD_BOOT_URL_SIZE];
  QRCode qr;
  static uint8_t qr_buf[256];
  uint16_t qr_buf_size;
  uint8_t qr_size;
  uint16_t qr_modules;
  int scale_text;
  int pad;
  int module_px;
  int qr_px;
  bool qr_right;
  int qr_x, qr_y, avail_w, text_y;
  char name_line[16];
  char fw_line[20];
  const char *domain_line = "OPENDISPLAY.ORG";
  char key_hex[33];
  char k1[17], k2[17];
  uint16_t dW, nW, fwW, k1W, k2W;

  if (cfg == nullptr || cfg->display_count == 0u) {
    return false;
  }
  dc = &cfg->displays[0];
  w = (uint16_t)epd.width;
  h = (uint16_t)epd.height;

  last3 = (uint32_t)(SYSTEM_GetUnique() & 0xFFFFFFu);
  key = sec != nullptr ? sec->encryption_key : zero_key;
  show_key = sec != nullptr && (sec->flags & SECURITY_FLAG_SHOW_KEY_ON_SCREEN) != 0u;
  if (!od_boot_url_build(dc->legacy_tag_type, last3, key, show_key,
                         cfg->manufacturer_data.manufacturer_id, url, sizeof(url))) {
    return false;
  }

  qr_buf_size = qrcode_getBufferSize(6u);
  if (qr_buf_size == 0u || qr_buf_size > sizeof(qr_buf)) {
    return false;
  }
  if (qrcode_initText(&qr, qr_buf, 6u, ECC_MEDIUM, url) != 0) {
    return false;
  }
  qr_size = qr.size;
  qr_modules = (uint16_t)(qr_size + 8u);

  (void)snprintf(name_line, sizeof(name_line), "OD%06lX", (unsigned long)last3);
  {
    uint16_t ver = opendisplay_ble_get_app_version();
    (void)snprintf(fw_line, sizeof(fw_line), "FW:S %u.%u.%u",
                   (unsigned)((ver >> 8) & 0xFFu), (unsigned)(ver & 0xFFu),
                   (unsigned)opendisplay_ble_get_app_version_patch());
  }
  od_boot_format_key_display(key, show_key, key_hex);
  memcpy(k1, key_hex, 16);
  k1[16] = '\0';
  memcpy(k2, key_hex + 16, 16);
  k2[16] = '\0';

  {
    static const char *boot_lines[] = {
      domain_line, name_line, fw_line, k1, k2,
    };
    uint16_t max_text_w;
    bool layout_ok = false;
    int try_scale;

    for (try_scale = (w >= 400u && h >= 300u) ? 2 : 1; try_scale >= 1 && !layout_ok; try_scale--) {
      scale_text = try_scale;
      pad = 6 * scale_text;
      max_text_w = boot_max_text_width(boot_lines, 5u, scale_text);
      layout_ok = boot_layout_fit(w, h, scale_text, pad, (int)qr_modules, &module_px, &qr_px, &qr_right, &qr_x,
                                  &qr_y, &avail_w, &text_y, max_text_w);
    }
    if (!layout_ok) {
      scale_text = 1;
      pad = 6;
      max_text_w = boot_max_text_width(boot_lines, 5u, scale_text);
      module_px = 1;
      qr_px = module_px * (int)qr_modules;
      qr_right = false;
      qr_x = ((int)w - qr_px) / 2;
      qr_y = (int)h - pad - qr_px;
      if (qr_y < pad) {
        qr_y = pad;
      }
      avail_w = (int)w - pad * 2;
      text_y = pad;
    }
  }

  {
    static uint8_t s_boot_row[256];
    bool is3clr = (epd.iFlags & BBEP_3COLOR) != 0;
    bool is_gray4 = dc->color_scheme == OD_COLOR_SCHEME_GRAY4;
    int bits_per_pixel = opendisplay_color_bits_per_pixel(dc->color_scheme);
    int pitch = ((int)w * bits_per_pixel + 7) / 8;
    int plane_pitch = ((int)w + 7) / 8;
    size_t workspace = (size_t)pitch;
    uint8_t white_byte = 0xFFu;
    int domX, nameX, fwX, k1X, k2X, y;
    int text_max_x;
    int text_origin_x;

    if (is_gray4) {
      workspace += (size_t)plane_pitch;
    }
    if (workspace > sizeof(s_boot_row)) {
      return false;
    }
    if (dc->color_scheme == OD_COLOR_SCHEME_BWRY) {
      white_byte = 0x55u;
    } else if (dc->color_scheme == OD_COLOR_SCHEME_BWGBRY) {
      white_byte = 0x11u;
    }

    dW  = text_width_px(domain_line, scale_text);
    nW  = text_width_px(name_line, scale_text);
    fwW = text_width_px(fw_line, scale_text);
    k1W = text_width_px(k1, scale_text);
    k2W = text_width_px(k2, scale_text);
    text_origin_x = qr_right ? pad : ((int)w - (int)avail_w) / 2;
    if (text_origin_x < pad) {
      text_origin_x = pad;
    }
    text_max_x = qr_right ? (qr_x - pad) : (int)w;
    domX  = text_origin_x + ((avail_w - (int)dW)  / 2);
    nameX = text_origin_x + ((avail_w - (int)nW)  / 2);
    fwX   = text_origin_x + ((avail_w - (int)fwW) / 2);
    k1X   = text_origin_x + ((avail_w - (int)k1W) / 2);
    k2X   = text_origin_x + ((avail_w - (int)k2W) / 2);
    if (domX < pad) {
      domX = pad;
    }
    if (nameX < pad) {
      nameX = pad;
    }
    if (fwX < pad) {
      fwX = pad;
    }
    if (k1X < pad) {
      k1X = pad;
    }
    if (k2X < pad) {
      k2X = pad;
    }

    const int render_passes = is_gray4 ? 2 : 1;
    for (int pass = 0; pass < render_passes; pass++) {
      bbepSetAddrWindow(&epd, 0, 0, (int)w, (int)h);
      bbepStartWrite(&epd, is_gray4 ? (pass == 0 ? PLANE_0 : PLANE_1)
                                    : opendisplay_color_start_plane(dc->color_scheme));

