davelee98/Firmware_Unified/targets/efr32bg22-slc/opendisplay_display.cpp
      for (y = 0; y < (int)h; y++) {
        memset(s_boot_row, white_byte, (size_t)pitch);

        draw_text_row(s_boot_row, y, domX,  text_y,                      domain_line, scale_text, bits_per_pixel,
                      text_max_x);
        draw_text_row(s_boot_row, y, nameX, text_y + boot_line_step(scale_text), name_line, scale_text, bits_per_pixel,
                      text_max_x);
        draw_text_row(s_boot_row, y, fwX,   text_y + boot_line_step(scale_text) * 2, fw_line, scale_text, bits_per_pixel,
                      text_max_x);
        draw_text_row(s_boot_row, y, k1X,   text_y + boot_line_step(scale_text) * 3, k1, scale_text, bits_per_pixel,
                      text_max_x);
        draw_text_row(s_boot_row, y, k2X,   text_y + boot_line_step(scale_text) * 4, k2, scale_text, bits_per_pixel,
                      text_max_x);

        if (y >= qr_y && y < qr_y + qr_px) {
          int local_y = y - qr_y;
          int my = local_y / module_px;
          if (my < (int)qr_modules) {
            int qy_qr = my - 4;
            int mx;
            for (mx = 0; mx < (int)qr_modules; mx++) {
              int qx_qr = mx - 4;
              bool on = false;
              if (qx_qr >= 0 && qy_qr >= 0 && qx_qr < (int)qr_size && qy_qr < (int)qr_size) {
                on = qrcode_getModule(&qr, (uint8_t)qx_qr, (uint8_t)qy_qr);
              }
              if (!on) {
                continue;
              }
              {
                int px0 = qr_x + mx * module_px;
                int sx;
                for (sx = 0; sx < module_px; sx++) {
                  int px = px0 + sx;
                  if (px >= 0 && px < (int)w) {
                    set_pixel_row(s_boot_row, px, bits_per_pixel);
                  }
                }
              }
            }
          }
        }

        if (is_gray4) {
          uint8_t *plane_row = s_boot_row + pitch;
          make_gray4_plane_row(plane_row, s_boot_row, plane_pitch, w, pass);
          bbepWriteData(&epd, plane_row, plane_pitch);
        } else {
          bbepWriteData(&epd, s_boot_row, pitch);
        }
      }
    }
    if (is3clr) {
      bbepStartWrite(&epd, PLANE_1);
      for (y = 0; y < (int)h; y++) {
        memset(s_boot_row, 0x00u, (size_t)pitch);
        bbepWriteData(&epd, s_boot_row, pitch);
      }
    }
  }
  return true;
}

static bool wait_for_refresh(uint32_t timeout_ms)
{
  uint32_t elapsed = 0;
  bool saw_busy = false;
  while (elapsed < timeout_ms) {
    bool busy = bbepIsBusy(&s_epd);
    if (busy) {
      saw_busy = true;
    } else if (saw_busy) {
      return true;
    }
    sl_sleeptimer_delay_millisecond(50);
    elapsed += 50;
  }
  return saw_busy && !bbepIsBusy(&s_epd);
}

extern "C" void opendisplay_display_abort(void)
{
  if (s_active) {
    bbepSleep(&s_epd, DEEP_SLEEP);
  }
  display_power_set(false);
  s_active = false;
  s_total_bytes = 0;
  s_written_bytes = 0;
  s_dw_chunk_n = 0;
  s_dw_log_pct = 0;
  s_dw_trailing_ignores = 0;
  s_plane_size = 0;
  s_plane2_started = false;
  s_dw_compressed = false;
  s_dw_decompressed_total = 0;
}

static void dw_log_progress(void)
{
  if (s_total_bytes == 0u) {
    return;
  }
  uint8_t pct = (uint8_t)((100u * s_written_bytes) / s_total_bytes);
  if (pct >= s_dw_log_pct + 25u) {
    printf("[OD] dw data #%lu %lu/%lu B (%u%%)%s\r\n", (unsigned long)s_dw_chunk_n,
           (unsigned long)s_written_bytes, (unsigned long)s_total_bytes, (unsigned)pct,
           s_dw_compressed ? " zlib" : "");
    s_dw_log_pct = (pct / 25u) * 25u;
  }
}

static int dw_stream_raw_bytes(const uint8_t *payload, uint32_t payload_len)
{
  uint32_t remaining = (s_written_bytes < s_total_bytes) ? (s_total_bytes - s_written_bytes) : 0u;
  const bool bitplanes = opendisplay_color_is_bitplanes(s_color_scheme);
  const uint8_t *p = payload;
  uint32_t left = payload_len;
  const uint32_t written_before = s_written_bytes;

  while (left > 0u && remaining > 0u) {
    uint32_t rem = remaining;
    uint32_t chunk = left;
    if (bitplanes && !s_plane2_started && s_plane_size > 0u) {
      uint32_t to_plane_end = s_plane_size - s_written_bytes;
      if (chunk > to_plane_end) {
        chunk = to_plane_end;
      }
    }
    if (chunk > rem) {
      chunk = rem;
    }
    if (chunk == 0u) {
      break;
    }
    bbepWriteData(&s_epd, (uint8_t *)(void *)p, (int)chunk);
    p += chunk;
    left -= chunk;
    s_written_bytes += chunk;
    remaining -= chunk;
    if (bitplanes && !s_plane2_started && s_plane_size > 0u && s_written_bytes >= s_plane_size) {
      bbepStartWrite(&s_epd, PLANE_1);
      s_plane2_started = true;
    }
  }

  if (s_written_bytes > written_before) {
    dw_log_progress();
  }
  return 0;
}

static bool zlib_stream_to_direct_write(const uint8_t *data, uint32_t len, bool final)
{
  od_zlib_status_t status = od_zlib_stream_push(data, len, final);
  if (status == OD_ZLIB_STATUS_ERROR) {
    printf("[OD] zlib push error: %s\r\n", od_zlib_stream_error());
    return false;
  }

  for (;;) {
    size_t bytes_out = 0;
    status = od_zlib_stream_poll(s_decompression_chunk, OPENDISPLAY_DECOMPRESSION_CHUNK_SIZE, &bytes_out);
    if (bytes_out > 0u) {
      uint32_t before = s_written_bytes;
      if (dw_stream_raw_bytes(s_decompression_chunk, (uint32_t)bytes_out) != 0) {
        return false;
      }
      if (s_written_bytes - before != (uint32_t)bytes_out) {
        return false;
      }
      if (s_written_bytes > s_dw_decompressed_total) {
        return false;
      }
    }
    if (status == OD_ZLIB_STATUS_OUTPUT_READY) {
      continue;
    }
    if (status == OD_ZLIB_STATUS_NEEDS_INPUT) {
      return !final;
    }
    if (status == OD_ZLIB_STATUS_DONE) {
      return s_written_bytes == s_dw_decompressed_total;
    }
    printf("[OD] zlib poll error: %s\r\n", od_zlib_stream_error());
    return false;
  }
}

extern "C" void opendisplay_display_boot_apply(void)
{
  const struct DisplayConfig *d = display_cfg();
  int panel;
  if (s_boot_applied || d == nullptr) {
    return;
  }
  s_boot_applied = true;
  panel = opendisplay_map_epd(d->panel_ic_type);
  if (panel == EP_PANEL_UNDEFINED) {
    return;
  }
  memset(&s_epd, 0, sizeof(s_epd));
  display_power_set(true);
  if (bbepSetPanelType(&s_epd, panel) != BBEP_SUCCESS) {
    display_power_set(false);
    return;
  }
#if OD_CAP_DUAL_CS == 0
  if ((s_epd.iFlags & BBEP_SPLIT_BUFFER) != 0u) {
    display_power_set(false);
    return;
  }
#endif
  bbepSetRotation(&s_epd, (int)d->rotation * 90);
  bbepInitIO(&s_epd, d->dc_pin, d->reset_pin, d->busy_pin, d->cs_pin, d->data_pin, d->clk_pin, 0);
  od_bbep_wake(&s_epd);
  od_bbep_send_panel_init_full(&s_epd);
  if (!render_boot_screen(s_epd, opendisplay_get_global_config())) {
    bbepSleep(&s_epd, DEEP_SLEEP);
    display_power_set(false);
    return;
  }
  /* The class's refresh(mode, bWait=true) called bbepWaitBusy() itself after a successful
     * refresh; the bare function does not. Written out explicitly -- dropping it would let boot
     * proceed while the panel was still refreshing. */
  if (bbepRefresh(&s_epd, REFRESH_FULL) == BBEP_SUCCESS) {
    bbepWaitBusy(&s_epd);
  }
  bbepSleep(&s_epd, DEEP_SLEEP);
  display_power_set(false);
}

extern "C" int opendisplay_display_direct_write_start(const uint8_t *payload, uint16_t payload_len)
{
  s_dw_init_t0 = sl_sleeptimer_get_tick_count();
  printf("[OD] dw init begin\r\n");

  const struct DisplayConfig *d = display_cfg();
  if (d == nullptr) {
    printf("[OD] dw start err no display cfg\r\n");
    return -1;
  }
  dw_init_mark("after cfg");

