davelee98/Firmware_Unified/targets/efr32bg22-slc/opendisplay_display.cpp
  int panel = opendisplay_map_epd(d->panel_ic_type);
  if (panel == EP_PANEL_UNDEFINED) {
    printf("[OD] dw start err bad panel_ic_type=%u\r\n", (unsigned)d->panel_ic_type);
    return -2;
  }

  opendisplay_display_abort();
  dw_init_mark("after abort");
  display_power_set(true);
  memset(&s_epd, 0, sizeof(s_epd));
  if (bbepSetPanelType(&s_epd, panel) != BBEP_SUCCESS) {
    printf("[OD] dw start err setPanelType panel=%d\r\n", panel);
    display_power_set(false);
    return -3;
  }
#if OD_CAP_DUAL_CS == 0
  if ((s_epd.iFlags & BBEP_SPLIT_BUFFER) != 0u) {
    display_power_set(false);
    return -4;
  }
#endif
  dw_init_mark("after setPanelType");

  bbepSetRotation(&s_epd, (int)d->rotation * 90);
  bbepInitIO(&s_epd, d->dc_pin, d->reset_pin, d->busy_pin, d->cs_pin, d->data_pin, d->clk_pin, 0);
  dw_init_mark("after initIO");
  od_bbep_wake(&s_epd);
  dw_init_mark("after wake (reset + busy)");
  od_bbep_send_panel_init_full(&s_epd);
  dw_init_mark("after pInitFull");
  bbepSetAddrWindow(&s_epd, 0, 0, d->pixel_width, d->pixel_height);
  dw_init_mark("after setAddrWindow");

  s_color_scheme = d->color_scheme;
  s_plane_size = 0;
  s_plane2_started = false;
  if (opendisplay_color_is_bitplanes(s_color_scheme)) {
    s_plane_size = opendisplay_color_bitplane_plane_bytes(d->pixel_width, d->pixel_height);
  }
  s_total_bytes =
    opendisplay_color_direct_write_total_bytes(d->pixel_width, d->pixel_height, s_color_scheme);
  {
    int sp = opendisplay_color_start_plane(s_color_scheme);
    bbepStartWrite(&s_epd, sp == 0 ? PLANE_0 : PLANE_1);
  }
  dw_init_mark("after startWrite");

  s_written_bytes = 0;
  s_dw_chunk_n = 0;
  s_dw_log_pct = 0;
  s_dw_trailing_ignores = 0;
  s_dw_compressed = (payload != nullptr && payload_len >= 4u);
  s_dw_decompressed_total = 0;
  s_active = true;

  if (s_dw_compressed) {
    /* ZIP (0x02) and/or streaming_decompression / ZIPXL (0x01): both mean
     * streaming zlib inflate. Post-2.0 configs may set only bit 0. */
    if ((d->transmission_modes & (TRANSMISSION_MODE_ZIP | TRANSMISSION_MODE_ZIPXL)) == 0u) {
      printf("[OD] dw start err compression not enabled in transmission_modes\r\n");
      opendisplay_display_abort();
      return -4;
    }
    s_dw_decompressed_total =
      (uint32_t)payload[0]
      | ((uint32_t)payload[1] << 8)
      | ((uint32_t)payload[2] << 16)
      | ((uint32_t)payload[3] << 24);
    if (s_dw_decompressed_total != s_total_bytes) {
      printf("[OD] dw start err zlib size %lu != %lu\r\n",
             (unsigned long)s_dw_decompressed_total, (unsigned long)s_total_bytes);
      opendisplay_display_abort();
      return -5;
    }
    od_zlib_stream_reset(s_dw_decompressed_total);
    if (payload_len > 4u) {
      if (!zlib_stream_to_direct_write(payload + 4, (uint32_t)payload_len - 4u, false)) {
        opendisplay_display_abort();
        return -6;
      }
    }
  } else if (payload_len != 0u) {
    printf("[OD] dw start note non-empty payload len=%u (ignored)\r\n", (unsigned)payload_len);
  }

  printf("[OD] dw start total=%lu B bpp=%d cs=%u panel=%u %ux%u bitplanes=%d%s\r\n",
         (unsigned long)s_total_bytes, opendisplay_color_bits_per_pixel(s_color_scheme),
         (unsigned)s_color_scheme, (unsigned)d->panel_ic_type, (unsigned)d->pixel_width,
         (unsigned)d->pixel_height, (int)opendisplay_color_is_bitplanes(s_color_scheme),
         s_dw_compressed ? " zlib" : "");
  return 0;
}

extern "C" int opendisplay_display_direct_write_data(const uint8_t *payload, uint16_t payload_len)
{
  if (!s_active || payload == nullptr || payload_len == 0u) {
    printf("[OD] dw data bad arg active=%d len=%u\r\n", (int)s_active, (unsigned)payload_len);
    return -1;
  }

  if (s_dw_compressed) {
    const uint32_t written_before = s_written_bytes;
    if (!zlib_stream_to_direct_write(payload, payload_len, false)) {
      return -3;
    }
    if (s_written_bytes > written_before) {
      s_dw_chunk_n++;
    }
    return 0;
  }

  uint32_t remaining = (s_written_bytes < s_total_bytes) ? (s_total_bytes - s_written_bytes) : 0u;
  if (remaining == 0u) {
    if (payload_len > 0u) {
      if (s_dw_trailing_ignores < 4u) {
        printf("[OD] dw data ignore trailing chunk #%u len=%u (have %lu/%lu B)\r\n",
               (unsigned)s_dw_trailing_ignores + 1u, (unsigned)payload_len,
               (unsigned long)s_written_bytes, (unsigned long)s_total_bytes);
        s_dw_trailing_ignores++;
      }
    }
    return 0;
  }

  const uint32_t written_before = s_written_bytes;
  if (dw_stream_raw_bytes(payload, payload_len) != 0) {
    return -2;
  }
  if (s_written_bytes > written_before) {
    s_dw_chunk_n++;
  }
  return 0;
}

static int s_dw_refresh_mode = REFRESH_FULL;

extern "C" int opendisplay_display_direct_write_end_prepare(const uint8_t *payload,
                                                              uint16_t payload_len)
{
  if (!s_active) {
    printf("[OD] dw end err inactive\r\n");
    return -1;
  }
  if (s_dw_compressed) {
    if (!zlib_stream_to_direct_write(nullptr, 0, true)) {
      printf("[OD] dw end err zlib finalize\r\n");
      return -3;
    }
  }
  if (s_written_bytes < s_total_bytes) {
    printf("[OD] dw end err incomplete wr=%lu need=%lu\r\n", (unsigned long)s_written_bytes,
         (unsigned long)s_total_bytes);
    return -2;
  }
  s_dw_refresh_mode = REFRESH_FULL;
  if (payload != nullptr && payload_len >= 1u && payload[0] == 1u) {
    s_dw_refresh_mode = REFRESH_FAST;
  }
  return 0;
}

extern "C" int opendisplay_display_direct_write_end_refresh(bool *refresh_ok)
{
  if (!s_active) {
    return -1;
  }
  if (refresh_ok != nullptr) {
    *refresh_ok = false;
  }

  printf("[OD] dw refresh start mode=%d\r\n", s_dw_refresh_mode);
  (void)bbepRefresh(&s_epd, s_dw_refresh_mode);
  bool ok = wait_for_refresh(60000u);
  printf("[OD] dw refresh done ok=%d busy=%d\r\n", (int)ok, (int)bbepIsBusy(&s_epd));
  bbepSleep(&s_epd, DEEP_SLEEP);
  s_active = false;
  s_dw_compressed = false;
  s_dw_decompressed_total = 0;
  display_power_set(false);

  if (refresh_ok != nullptr) {
    *refresh_ok = ok;
  }
  return 0;
}

extern "C" int opendisplay_display_direct_write_end(const uint8_t *payload,
                                                      uint16_t payload_len,
                                                      bool *refresh_ok)
{
  int rc = opendisplay_display_direct_write_end_prepare(payload, payload_len);
  return rc == 0 ? opendisplay_display_direct_write_end_refresh(refresh_ok) : rc;
}
